{
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "model_type": "gpt2",
  "vocab_size": 50257,
  "n_positions": 512,
  "n_embd": 384,
  "n_layer": 8,
  "n_head": 8,
  "n_inner": 1536,
  "activation_function": "gelu_new",
  "resid_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "attn_pdrop": 0.1,
  "layer_norm_epsilon": 1e-05,
  "initializer_range": 0.02,
  "bos_token_id": 50256,
  "eos_token_id": 50256,
  "tie_word_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0",
  "mlx_training": {
    "framework": "MLX",
    "iterations": 35000,
    "final_loss": 3.4639759063720703,
    "dataset": "finewebedu",
    "max_tokens": 10000000
  }
}